//#include <stdio.h>
// C语言是结构化的程序设计语言
// 顺序结构 选择结构(分支语句) 循环结构(循环语句)
// 用分号隔开的就是一条语句

// if语句 =============================================
/*
if(表达式)
    语句;
*/
//以及if的变种
/*
if(表达式)
    语句1;
else
    语句2;
*/
//再以及if变种的变种
/*
if(表达式1)
    语句1;
else if(表达式2)
    语句2;
else
    语句3;
*/

//举个栗子
//int main()
//{
//    int age = 29;
//    if (age >= 18 && age < 26)
//        printf("青年\n");
//    else if (age >= 26 && age < 40)
//        printf("中年\n");
//    else
//    {
//        printf("未成年人\n"); //if和else默认只能控制一条语句,否则要用大括号括起来
//        printf("不能谈恋爱\n");
//    }
//}

//悬空else - else和离他最近的那个if匹配 就近原则(解决办法 加上大括号)
//int main()
//{
//    int a = 0;
//    int b = 2;
//    if (a == 1)
//        if (b == 2)
//            printf("hehe\n");
//    else
//        printf("haha\n");
//    return 0;
//}

//1.一个数是不是奇数 不小心删了

//2.输出1-100之间的奇数
//int main()
//{
//    int i = 0;
//    for (i = 1; i <= 100; i++)
//    {
//        if (i % 2 == 1)
//        {
//            printf("%d ", i);
//        }
//    }
//    return 0;
//}
